In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("data/pan/doc_vectors.csv")

In [8]:
df.authorIDs.unique()

array(['en_110', 'en_112', 'en_76', 'en_62', 'en_19', 'en_54', 'en_52',
       'en_4', 'en_12', 'en_20', 'en_13', 'en_60', 'en_66', 'en_3',
       'en_101', 'en_59', 'en_77', 'en_98', 'en_57', 'en_78', 'en_2',
       'en_34', 'en_113', 'en_111', 'en_5', 'en_104', 'en_37', 'en_75',
       'en_102', 'en_35', 'en_72', 'en_103', 'en_11', 'en_99', 'en_22',
       'en_21', 'en_63', 'en_108', 'en_51', 'en_97', 'en_74', 'en_53',
       'en_105', 'en_61', 'en_100', 'en_36', 'en_56', 'en_18', 'en_107',
       'en_67', 'en_58', 'en_73', 'en_96', 'en_109', 'en_114', 'en_55'],
      dtype=object)

In [9]:
blogs = pd.read_csv("data/blogs/blogtext.csv")

,id,gender,age,topic,sign,date,text
0,2059027,male,15,Student,Leo,"14,May,2004","Info has been found (+/- 100 pages,..."
1,2059027,male,15,Student,Leo,"13,May,2004",These are the team members: Drewe...
2,2059027,male,15,Student,Leo,"12,May,2004",In het kader van kernfusie op aarde...
3,2059027,male,15,Student,Leo,"12,May,2004",testing!!! testing!!!
4,3581210,male,33,InvestmentBanking,Aquarius,"11,June,2004",Thanks to Yahoo!'s Toolbar I can ...